
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	
	
	
	
	ЗапросСотрудники = Новый Запрос;
	ЗапросСотрудники.Текст = "ВЫБРАТЬ
	|	СправочникСотрудники.Код КАК Код,
	|	ДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	СправочникФизическиеЛица.ДатаРождения КАК ДатаРождения,
	|	ДанныеСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
	|	ДанныеСотрудников.ДатаПриема КАК ДатаПриема,
	|	ДанныеДляПодбораСотрудников.Подразделение КАК Подразделение,
	|	ДанныеДляПодбораСотрудников.Должность КАК Должность,
	|	СправочникФизическиеЛица.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	ЕСТЬNULL(ДокументыФизических.ВидДокумента, """") КАК ВидДокумента,
	|	ЕСТЬNULL(ДокументыФизических.Серия, """") КАК Серия,
	|	ЕСТЬNULL(ДокументыФизических.Номер, """") КАК Номер,
	|	ЕСТЬNULL(ДокументыФизических.ДатаВыдачи, """") КАК ДатаВыдачи,
	|	СправочникСотрудники.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_СписокСотрудников
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
	|		ПО (СправочникСотрудники.Ссылка = ДанныеСотрудников.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СправочникФизическиеЛица
	|		ПО (СправочникФизическиеЛица.Ссылка = ДанныеСотрудников.ФизическоеЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
	|		ПО (СправочникСотрудники.Ссылка = ДанныеДляПодбораСотрудников.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизических
	|		ПО (ДанныеСотрудников.ФизическоеЛицо = ДокументыФизических.Физлицо)
	|ГДЕ
	|	(ДанныеСотрудников.ДатаУвольнения > КОНЕЦПЕРИОДА(&ПериодПо, ДЕНЬ)
	|			ИЛИ ДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
	|	И ДанныеСотрудников.ДатаПриема < КОНЕЦПЕРИОДА(&ПериодПо, ДЕНЬ)
	|	И ДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДанныеДляПодбораСотрудников.Окончание = ДАТАВРЕМЯ(3999, 12, 31)
	|	И ДокументыФизических.ЯвляетсяДокументомУдостоверяющимЛичность = ИСТИНА 
	|  
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК АдресПоПрописке
	|ПОМЕСТИТЬ ВТ_ФизическиеЛицаАдресПрописки
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ФизическиеЛицаКонтактнаяИнформация.Ссылка = ФизическиеЛица.Ссылка
	|			И (ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокСотрудников.Код КАК Код,
	|	ВТ_СписокСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_СписокСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_СписокСотрудников.ДатаРождения КАК ДатаРождения,
	|	ВТ_СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТ_СписокСотрудников.ДатаУвольнения КАК ДатаУвольнения,
	|	ВТ_СписокСотрудников.ДатаПриема КАК ДатаПриема,
	|	ВТ_СписокСотрудников.Подразделение КАК Подразделение,
	|	ВТ_СписокСотрудников.Должность КАК Должность,
	|	ВТ_СписокСотрудников.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	ВТ_СписокСотрудников.ВидДокумента КАК ВидДокумента,
	|	ВТ_СписокСотрудников.Серия КАК Серия,
	|	ВТ_СписокСотрудников.Номер КАК Номер,
	|	ВТ_СписокСотрудников.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ФизическиеЛицаАдресПрописки.АдресПоПрописке,
	|	ВЫРАЗИТЬ("""") КАК Паспорт,
	|	ВЫРАЗИТЬ("""") КАК Образование,
	|	ВЫРАЗИТЬ("""") КАК УчебноеЗаведение,
	|	ВЫРАЗИТЬ("""") КАК СерияНомерДиплома,
	|	ВЫРАЗИТЬ("""") КАК Специальность	
	|ИЗ
	|	ВТ_СписокСотрудников КАК ВТ_СписокСотрудников       
	|	ЛЕВОЕ СОЕДИНЕНИЕ  ВТ_ФизическиеЛицаАдресПрописки КАК ВТ_ФизическиеЛицаАдресПрописки
	|	ПО (ВТ_СписокСотрудников.ФизическоеЛицо = ВТ_ФизическиеЛицаАдресПрописки.Ссылка)
	|
	|ГДЕ
	|   ВТ_СписокСотрудников.ГоловнаяОрганизация = &Организация
	|   И 0 = 0
	|
	|   УПОРЯДОЧИТЬ ПО ВТ_СписокСотрудников.Наименование";  
	
	
	Если ЗначениеЗаполнено(СписокПодразделений) Тогда
		
		ТекстУсловия = "ВТ_СписокСотрудников.Подразделение = &Подразделение";
		ЗапросСотрудники.Текст = СтрЗаменить(ЗапросСотрудники.Текст, "0 = 0", ТекстУсловия);
		ЗапросСотрудники.Параметры.Вставить("Подразделение", СписокПодразделений);
				
	КонецЕсли;
	
	
	
	ЗапросСотрудники.Параметры.Вставить("ПериодПо",  НаДату);
		ЗапросСотрудники.Параметры.Вставить("Организация",  СписокОрганизаций);
